app/controllers/haikus_controller.rb

SELECT * FROM "haikus" ORDER BY created_at DESC
---
  def index
    @haikus = Haiku.all(:include => :movie, :include => :poet, :order => "created_at DESC")

SELECT * FROM "haikus" WHERE ("haikus"."id" = 0)
SELECT * FROM "movies" WHERE ("movies"."id" = 8)
SELECT * FROM "poets" WHERE ("poets"."id" = 1)
---
  def show
    @haiku = Haiku.find(params[:id], :include=>:movie, :include=>:poet)

SELECT * FROM "haikus" WHERE ("haikus"."id" = 1)
SELECT * FROM "movies" WHERE ("movies"."id" = 8)
SELECT * FROM "poets" WHERE ("poets"."id" = 1)
---
  def edit
    @haiku = Haiku.find(params[:id], :include=>:movie, :include=>:poet)

INSERT INTO "haikus" ("line1", "line2", "updated_at", "line3", "movie", "poet", "email", "created_at") VALUES('one''s a loutish bad boyfriend', 'one scottish boyfriend', '2009-08-06 03:15:53', 'two gwens are ever smiling', 'Sliding Doors', 'Anna', 'banane@gmail.com', '2009-08-06 03:15:53')
---
  def create
    @haiku = Haiku.new(params[:haiku])

    respond_to do |format|
      if @haiku.save

SELECT * FROM "haikus" WHERE ("haikus"."id" = 2)
UPDATE "haikus" SET "line3" = 'Same ole rom com plot', "updated_at" = '2009-08-13 08:14:04', "line2" = 'Says he, she''s cute but anal' WHERE "id" = 4
---
  def update
    @haiku = Haiku.find(params[:id])

    respond_to do |format|
      if @haiku.update_attributes(params[:haiku])