app/controllers/home_controller.rb

  def index
       @haiku = Haiku.last(:include => :movie, :include => :poet)
---
SELECT * FROM "haikus" GROUP BY movie ORDER BY movie DESC LIMIT 10
SELECT * FROM "movies" ORDER BY movies.id DESC LIMIT 1