app/controllers/movies_controller.rb

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
---
  def show
    @movies = Movies.find(params[:id])