app/controllers/movies_controller.rb

  def index
    @movies = Movie.all(:order => " year DESC ")
---
SELECT * FROM "movies" ORDER BY year, name DESC

  def show

     @haikus = Haiku.all(:conditions => {:movie_id => params[:id]}, :include => :movie, :include => :poet)
---
SELECT * FROM "haikus" WHERE ("haikus"."movie_id" IS NULL)
SELECT * FROM "movies"

  def edit
    @movie = Movie.find(params[:id])
---
SELECT * FROM "movies" WHERE ("movies"."id" = 1)

  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("name", "updated_at", "year", "img_url", "aff_name", "created_at", "aff_url") VALUES('Much Ado About Nothing', '2009-08-09 03:29:38', '1993', 'http://cdn-0.nflximg.com/us/boxshots/large/779930.jpg', 'Netflix', '2009-08-09 03:29:38', 'http://www.netflix.com/Movie/Much_Ado_About_Nothing/779930')

  def update
    @movie = Movie.find(params[:id])

    respond_to do |format|
      if @movie.update_attributes(params[:movie])
---
SELECT * FROM "movies" WHERE ("movies"."id" = 1)
UPDATE "movies" SET "aff_url" = 'http://www.netflix.com/Movie/Sliding_Doors/1192903?lnkctr=srchrd-sr&strkid=1529502506_0_0&strackid=16631e59d29e16a4_0_srl', "aff_name" = 'Netflix', "updated_at" = '2009-08-09 03:26:15' WHERE "id" = 1

  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy
---
SELECT * FROM "movies" WHERE ("movies"."id" = 7)
DELETE FROM "movies" WHERE "id" = 7