app/controllers/movie_controller.rb

SELECT * FROM "haikus" ORDER BY movie DESC LIMIT 10
---
  def index
    @haikus = Haiku.all(:order => "movie DESC", :limit => 10)