app/controllers/poets_controller.rb

  def index
    @poets = Poet.all
---
SELECT * FROM "poets"

  def show
    @haikus = Haiku.all(:conditions => {:poet_id => params[:id]}, :include => :movie, :include => :poet, :order => " created_at DESC ")
---
SELECT * FROM "haikus" WHERE ("haikus"."poet_id" = '1') ORDER BY created_at DESC

  def edit
    @poet = Poet.find(params[:id])
---
SELECT * FROM "poets" WHERE ("poets"."id" = 1)

  def create
    @poet = Poet.new(params[:poet])

    respond_to do |format|
      if @poet.save
---
INSERT INTO "poets" ("name", "updated_at", "email", "created_at") VALUES('Anna', '2009-08-09 03:03:15', 'banane@gmail.com', '2009-08-09 03:03:15')