app/controllers/poets_controller.rb

  def show
    @poets = Poets.find(params[:id])
---
SELECT * FROM "poets" WHERE ("poets"."id" = 1)